# Taps
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "jesseduffield/lazygit"
tap "keith/formulae/reminders-cli"
tap "yakitrak/yakitrak"

# CLI Utilities
brew "wget"
brew "fzf"
brew "git"
brew "ripgrep"
brew "jq"
brew "gnu-sed"
brew "tmux"
brew "taskwarrior-tui"
brew "task"
brew "socat"
brew "netcat"
brew "socat"
brew "hping"
brew "name-that-hash"
brew "spoof-mmac"

# Development Tools
brew "python"
brew "pyenv"
brew "pyenv-virtualenv"
brew "go"
brew "node"
brew "rust"
brew "ruby"
brew "pipx"

# Editors & Shell Enhancements
brew "neovim"
brew "powerlevel10k"

# Kubernetes & Cloud
brew "helm"
brew "kubernetes-cli"
brew "k9s"
brew "terraform"
brew "azure-cli"
brew "aws"
brew "ansible"

# Networking & Security Tools
brew "nmap"
brew "tcptraceroute"
brew "telnet"
brew "ipcalc"
brew "bettercap"
brew "gobuster"

# System Monitoring
brew "htop"
brew "btop"
brew "neofetch"

# Database & Caching
brew "postgresql"
brew "redis"

# Containerization
brew "docker"
brew "docker-compose"
brew "gitlab-runner"

# Productivity & Misc
brew "yakitrak/yakitrak/obsidian-cli"
brew "keith/formulae/reminders-cli"
brew "spotifyd"
brew "spotify_player"
brew "nchat"

# Casks
cask "obsidian"
cask "spotify"
cask "alacritty"
cask "shortcat"
cask "raycast"
cask "discord"
cask "postman"
cask "karabiner-elements"
cask "rectangle"
cask "keepassxc"

# Fonts
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"

# Offensive/Penetration Testing Tools
brew "aircrack-ng"               # Wi-Fi cracking tool
brew "metasploit"                # Exploitation framework
brew "burp-suite"                # Web vulnerability scanner
brew "nikto"                     # Web server scanner
brew "sqlmap"                    # Automated SQL injection tool
brew "dnsrecon"                  # DNS reconnaissance tool
brew "theharvester"              # E-mail and domain info gathering tool
brew "hydra"                     # Brute force password cracking tool
brew "crackmapexec"              # SMB enumeration and exploitation tool
brew "impacket"                  # Collection of Python tools for network penetration testing
brew "enum4linux"                # Linux SMB enumeration tool
brew "ncat"                      # Netcat, network exploration tool
brew "ettercap"                  # Network sniffing and man-in-the-middle attacks
brew "mitmproxy"                 # Intercepting proxy for HTTP/HTTPS
brew "gowitness"                 # Screenshot tool for phishing sites
brew "beef-xss"                  # Browser exploitation framework
brew "wpscan"                    # WordPress vulnerability scanner
brew "zap-cli"                   # Automated security scanner for ZAP
brew "sublist3r"                 # Subdomain discovery tool
brew "shodan-cli"                # Command-line interface for Shodan
brew "amass"                     # OSINT and subdomain enumeration
brew "wifite"                    # Automated Wi-Fi hacking tool
brew "mimikatz"                  # Windows post-exploitation tool
