tap "d99kris/nchat"
tap "hashicorp/tap"
tap "homebrew/services"
tap "hudochenkov/sshpass"
tap "jandedobbeleer/oh-my-posh"
tap "jeffreywildman/virt-manager"
tap "jstkdng/programs"
tap "keith/formulae"
tap "localstack/tap"
tap "null-dev/firefox-profile-switcher"
tap "rhettbull/macnotesapp", "https://github.com/RhetTbull/macnotesapp"
tap "yakitrak/yakitrak"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Library for command-line editing
brew "readline"
# Next-generation aircrack with lots of new features
brew "aircrack-ng"
# Cryptographic recipes and primitives for Python
brew "cryptography"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# OpenType text shaping engine
brew "harfbuzz"
# TIFF library and utilities
brew "libtiff"
# Development kit for the Java programming language
brew "openjdk"
# Java build tool
brew "ant"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Next generation open source RPC library and framework
brew "grpc"
# Next-gen compiler infrastructure
brew "llvm"
# Framework for scalable cross-language services development
brew "thrift"
# Columnar in-memory analytics layer designed to accelerate big data
brew "apache-arrow"
# Tool for reverse engineering 3rd party, closed, binary Android apps
brew "apktool"
# Portable library for network traffic capture
brew "libpcap"
# ARP scanning and fingerprinting tool
brew "arp-scan"
# C library for creating IP packets
brew "libnet"
# Utility to check whether MAC addresses are already taken on a LAN
brew "arping"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# B2 Cloud Storage Command-Line Tools
brew "b2-tools"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# C library implementing the SSH2 protocol
brew "libssh2"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# High performance key/value database
brew "berkeley-db"
# Swiss army knife for network attacks and monitoring
brew "bettercap"
# Searches a binary image for embedded files and executable code
brew "binwalk"
# Text-based, scriptable IRC client
brew "bitchx"
# Collection of portable C++ source libraries
brew "boost"
# Collection of portable C++ source libraries
brew "boost@1.85"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Powerful, enterprise-ready, open source web server with automatic HTTPS
brew "caddy"
# Computational Geometry Algorithms Library
brew "cgal"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Framework for layout and rendering of i18n text
brew "pango"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Rootkit detector
brew "chkrootkit"
# CLI to install, manage & troubleshoot Kubernetes clusters running Cilium
brew "cilium-cli"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Suite of command-line tools for converting to and working with CSV
brew "csvkit"
# Command-line csv viewer
brew "csvlens"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# More intuitive version of du in rust
brew "dust"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Asynchronous event library
brew "libevent"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Image processing and image analysis library
brew "leptonica"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Reliable Internet Stream Transport (RIST)
brew "librist"
# Secure Reliable Transport
brew "srt"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# GNU compiler collection
brew "gcc"
# Process Management Interface for HPC environments
brew "pmix"
# High performance message passing library
brew "open-mpi"
# Banner-like program prints strings as ASCII art
brew "figlet"
# X11 implementation of the Remote Desktop Protocol (RDP)
brew "freerdp"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Library access to GnuPG
brew "gpgme"
# File format designed to store large amounts of data
brew "hdf5"
# Network authentication protocol
brew "krb5"
# Cartographic Projections Library
brew "proj"
# Library and tools for dealing with GeoTIFF
brew "libgeotiff"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Postgres C API library
brew "libpq"
# Libraries and data formats for array-oriented scientific data
brew "netcdf"
# Package for scientific computing with Python
brew "numpy"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Geospatial Data Abstraction Library
brew "gdal"
# Platform built on V8 to build network applications
brew "node"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# AVH edition of git-flow
brew "git-flow-avh"
# Official GitLab CI runner
brew "gitlab-runner"
# Open-source GitLab command-line tool
brew "glab"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Directory/file & DNS busting tool written in Go
brew "gobuster"
# Development kit for the Java programming language
brew "openjdk@21"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# World's fastest and most advanced password recovery utility
brew "hashcat"
# Utils for conversion of cap/pcap/pcapng WiFi dump files
brew "hcxtools"
# Kubernetes package manager
brew "helm"
# Highly capable, feature-rich programming language
brew "perl"
# Command-line oriented TCP/IP packet assembler/analyzer
brew "hping"
# Improved top (interactive process viewer)
brew "htop"
# Apache HTTP server
brew "httpd"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Network, Service & Security Observability for Kubernetes using eBPF
brew "hubble"
# Configurable static site generator
brew "hugo"
# Network logon cracker which supports many services
brew "hydra"
# Library for reading RAW files from digital photo cameras
brew "libraw"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# GNU utilities for networking
brew "inetutils"
# Calculate various network masks, etc. from a given IP address
brew "ipcalc"
# CLI wrapper for basic network utilities on macOS - ip command
brew "iproute2mac"
# Modular IRC client
brew "irssi"
# Featureful UNIX password cracker
brew "john"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Little helper to run CNCF's k3s in Docker
brew "k3d"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Kubernetes controller and tool for one-way encrypted Secrets
brew "kubeseal"
# Simple terminal UI for git commands
brew "lazygit"
# Command-line, double-entry accounting tool
brew "ledger"
# Framework for scientific data networking
brew "libdap"
# C library for reading and writing MATLAB MAT files
brew "libmatio"
# Low level NFC SDK and Programmers API
brew "libnfc"
# Implementation of IEEE 802.1ab (LLDP)
brew "lldpd"
# List USB devices, just like the Linux lsusb command
brew "lsusb"
# Text-based web browser
brew "lynx"
# Java-based project management
brew "maven"
# Like sed, awk, cut, join & sort for name-indexed data such as CSV
brew "miller"
# Menu-driven communications program
brew "minicom"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Intercept, modify, replay, save HTTP/S traffic
brew "mitmproxy"
# Video processing framework with simplicity in mind
brew "vapoursynth"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Media player based on MPlayer and mplayer2
brew "mpv"
# Library for a binary-based efficient data interchange format
brew "msgpack"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Modern hash identification system
brew "name-that-hash"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Implements SNMP v1, v2c, and v3, using IPv4 and IPv6
brew "net-snmp"
# Utility for managing network connections
brew "netcat"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Web server scanner
brew "nikto"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node@18"
# Manage multiple Node.js versions
brew "nvm"
# Programming language with focus on simplicity, performance and modern systems
brew "odin"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Password manager
brew "pass"
# Search PDFs for strings matching a regular expression
brew "pdfgrep"
# Friendly PIL fork (Python Imaging Library)
brew "pillow"
# Paste PNG into files
brew "pngpaste"
# Cross-platform application and UI framework
brew "qt@5"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler-qt5"
# Cross-platform library for audio I/O
brew "portaudio"
# C++ wrapper library around CGAL
brew "sfcgal"
# Adds support for geographic objects to PostgreSQL
brew "postgis"
# Object-relational database system
brew "postgresql@14"
# Theme for zsh
brew "powerlevel10k"
# Hook preloader
brew "proxychains-ng"
# Python version management
brew "pyenv"
# Alternative to pyenv for managing virtualenvs
brew "pyenv-virtualenvwrapper"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Implements brute force attack to recover WPA/WPA2 passkeys
brew "reaver"
# Web Reconnaissance Framework
brew "recon-ng"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: :changed
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Modern Day Portscanner
brew "rustscan"
# Display and control your Android device
brew "scrcpy"
# Terminal multiplexer with VT100/ANSI terminal emulation
brew "screen"
# Flexible Network Intrusion Detection System
brew "snort"
# SOcket CAT: netcat on steroids
brew "socat"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Spoof your MAC address in macOS
brew "spoof-mac"
# Command driven spotify player
brew "spotify_player"
# Spotify daemon
brew "spotifyd"
# Penetration testing for SQL injection and database servers
brew "sqlmap"
# Strong open-source chess engine
brew "stockfish"
# CLI for out-of-band management of Kubernetes nodes created by Talos
brew "talosctl"
# Terminal user interface for taskwarrior
brew "taskwarrior-tui"
# Tool Command Language
brew "tcl-tk"
# Tool to build, change, and version infrastructure
brew "terraform"
# Granddaddy of HTML tools, with support for modern standards
brew "tidy-html5"
# Command-line time tracking application
brew "timewarrior"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Anonymizing overlay network for TCP
brew "tor"
# Image processing library
brew "vips"
# Python virtualenv extensions
brew "virtualenvwrapper"
# Pager/text based browser
brew "w3m"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Extensible IRC client
brew "weechat"
# Internet file retriever
brew "wget"
# ISO9660+RR manipulation tool
brew "xorriso"
# JavaScript package manager
brew "yarn"
# Tool for managing your YubiKey configuration
brew "ykman"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# General-purpose lossless data-compression library
brew "zlib"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Terminal-based Telegram / WhatsApp client
brew "d99kris/nchat/nchat"
# Consul
brew "hashicorp/tap/consul"
# Vault
brew "hashicorp/tap/vault"
brew "hudochenkov/sshpass/sshpass"
# Prompt theme engine for any shell
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
# App for virtualized guest interaction
brew "jeffreywildman/virt-manager/virt-viewer"
# Drop in replacement for ueberzug written in C++
brew "jstkdng/programs/ueberzugpp"
brew "keith/formulae/reminders-cli"
# Localstack cli packaged using pyinstaller
brew "localstack/tap/localstack-cli"
# The native component of the Profile Switcher for Firefox extension.
brew "null-dev/firefox-profile-switcher/firefox-profile-switcher-connector"
brew "yakitrak/yakitrak/obs", link: false
brew "yakitrak/yakitrak/obsidian-cli"
# Command-line tools for building and debugging Android apps
cask "android-commandlinetools"
# Android SDK component
cask "android-platform-tools"
# Eclipse-based LDAP browser and directory client
cask "apache-directory-studio"
# E-books management software
cask "calibre"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Disk space cleaner that finds and deletes duplicated and similar files
cask "gemini"
# Keyboard customiser
cask "karabiner-elements"
# Password manager app
cask "keepassxc"
# Penetration testing framework
cask "metasploit"
# Open source implementation of Microsoft's .NET Framework
cask "mono-mdk-for-visual-studio"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Open-source software for live streaming and screen recording
cask "obs"
# Command-line shell and scripting language
cask "powershell"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# App that enables mouse-free UI interaction
cask "shortcat"
# Replacement for RCDefaultApps, written in Swift
cask "swiftdefaultappsprefpane"
# Open-source version of the X.Org X Window System
cask "xquartz"
# Multi-platform graphical interface for official Nmap Security Scanner
cask "zenmap"
